tap "github/gh"
tap "heroku/brew"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-drivers"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
# tap "homebrew/services"
tap "planetscale/tap"
tap "stripe/stripe-cli"
tap "thoughtbot/formulae"
brew "act"
# brew "asciinema"
brew "awscli"
brew "bat" # A cat(1) clone with wings.
brew "bison"
brew "cairo"
brew "choosy"
brew "cmake"
brew "composer"
brew "dark-mode"
brew "dep"
brew "docutils"
brew "exercism"
brew "fd" # A simple, fast and user-friendly alternative to 'find'
brew "ffmpeg"
# brew "fish"
brew "foreman"
brew "fzf"
brew "fzy"
brew "gdbm"
brew "gh"
brew "git"
brew "git-extras"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "go"
brew "graphviz"
brew "guile"
brew "handbrake", link: false
brew "harfbuzz"
brew "heroku/brew/heroku"
# brew "hot" # 'formula is unreadable' error
brew "htop" # may need sudo
brew "hub"
brew "hugo"
# brew "imagemagick@6" # can usually use libvips instead
brew "jq"
brew "jsonpp"
# brew "kibana" # elasticsearch dashboard # changed to an incompatible license
brew "leiningen" # for clojure
brew "libass"
brew "libgda"
# brew "libpq" # better to install `postgresql`?
brew "librsvg"
brew "libssh"
brew "libvips"
brew "libxml2"
brew "libyaml"
brew "markdownlint-cli"
brew "mas"
brew "memcached"
brew "mitmproxy"
# brew "mysql"
# brew "mysql", restart_service: true, link: false
# brew "mysql-client@5.7", link: true
brew "ncdu" # disk usage
brew "neovim"
brew "node"
brew "overmind"
brew "pango"
brew "pkg-config"
brew "planetscale/tap/pscale"
brew "postgresql"
brew "pygments"
brew "rcm"
brew "re2"
brew "redis", restart_service: true
brew "ripgrep"
brew "trash" # removed: https://github.com/Homebrew/homebrew-core/pull/65438
brew "rtmpdump"
brew "ruby"
brew "ruby-install"
brew "selenium-server"
brew "sequel-ace"
brew "shadowenv"
brew "shared-mime-info"
brew "shellcheck"
brew "slack"
brew "sloccount"
brew "spotify"
brew "sqlite"
brew "srt"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "tcl-tk"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tree"
brew "unbound"
brew "v8@3.15"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zlib"
cask "alfred"
cask "arq"
cask "brave-browser"
# cask "catch" # tv show rss feeds
cask "ccmenu"
cask "chromedriver"
cask "google-chrome"
# cask "coconutbattery"
# cask "dash"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
# cask "fork" # Git client https://git-fork.com/
cask "freedom"
cask "github"
cask "gitify"
cask "google-cloud-sdk"
cask "google-drive"
# cask "handbrake"
cask "hot"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements" # requires extra permissions
cask "keyboard-cleaner"
cask "keycastr"
cask "kindle"
cask "kindlegen"
cask "launchcontrol"
cask "logitech-options" # requires sudo
cask "lunar"
cask "marked"
cask "meetingbar"
# cask "mysqlworkbench"
# cask "mongodb"
# brew cask install menumeters # semi-abandoned?
cask "ngrok" # beware, different from https://dashboard.ngrok.com/get-started/setup ? e.g. no `ngrok config` https://dashboard.ngrok.com/get-started/setup
cask "notion"
cask "nvidia-geforce-now"
cask "obs"
cask "omnidisksweeper"
cask "omnifocus" # add license after install
# cask "onyx"
cask "phantomjs"
cask "plex"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
# cask "qlmarkdown" # Security warnings
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quitter"
cask "rectangle" # need permissions on first launch
# cask "rubymine"
cask "rescuetime"
# cask "selfcontrol"
cask "send-to-kindle"
cask "sonos"
cask "sourcetree"
# cask "stretchly"
cask "stremio"
cask "the-unarchiver"
# cask "time-out"
cask "transmission" # p2p
cask "tunnelbear"
cask "tuple"
# cask "vagrant"
cask "vanilla"
# cask "virtualbox" needs security allowance
# cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
# cask "whatsapp"
cask "zoom"

# brew cask install qlcolorcode qlstephen qlmarkdown quicklook-json quicklook-csv qlimagesize webpquicklook qlvideo
