tap "github/gh"
tap "heroku/brew"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/cask-drivers"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
# tap "homebrew/services"
tap "planetscale/tap"
tap "stripe/stripe-cli"
tap "thoughtbot/formulae"
brew "act" # Run GitHub Actions locally
# brew "asciinema"
brew "awscli" # AWS command line interface
brew "bat" # A cat(1) clone with wings.
brew "bison" # Parser generator
brew "cairo" # 2D graphics library
brew "choosy" # Browser chooser utility
brew "cmake" # Cross-platform build system
brew "composer" # PHP dependency manager
brew "dark-mode" # Control macOS dark mode from CLI
brew "dep" # Go dependency management tool
brew "docutils" # Python documentation utilities
brew "exercism" # Code practice and mentorship platform CLI
brew "fd" # A simple, fast and user-friendly alternative to 'find'
brew "ffmpeg" # Multimedia framework for audio/video processing
brew "foreman" # Procfile-based application manager
brew "fzf" # Command-line fuzzy finder
brew "fzy" # Fast fuzzy text selector
brew "gdbm" # GNU database manager library
brew "gh" # GitHub command line tool
brew "git" # Distributed version control system
brew "git-extras" # Extra Git utilities
brew "glib" # Core application building blocks for GNOME
brew "gmp" # GNU multiple precision arithmetic library
brew "gnupg" # GNU Privacy Guard for encryption
brew "gnutls" # GNU Transport Layer Security library
brew "go" # Go programming language
brew "graphviz" # Graph visualization software
brew "guile" # GNU Ubiquitous Intelligent Language for Extensions
brew "handbrake", link: false # Video transcoder
brew "harfbuzz" # Text shaping engine
brew "heroku/brew/heroku" # Heroku command line interface
# brew "hot" # 'formula is unreadable' error
brew "htop" # may need sudo
# brew "imagemagick@6" # can usually use libvips instead
brew "jq" # Command-line JSON processor
brew "jsonpp" # JSON pretty printer
brew "libass" # Subtitle rendering library
brew "libgda" # GNOME database access library
# brew "libpq" # better to install `postgresql`?
brew "librsvg" # SVG rendering library
brew "libssh" # SSH library
brew "libvips" # Fast image processing library
brew "libxml2" # XML parsing library
brew "libyaml" # YAML parsing library
brew "markdownlint-cli" # Markdown linting tool
brew "mas" # Mac App Store command line interface
brew "memcached" # In-memory key-value store
brew "mitmproxy" # Interactive HTTPS proxy for debugging
# brew "mysql"
# brew "mysql", restart_service: true, link: false
# brew "mysql-client@5.7", link: true
brew "ncdu" # disk usage
brew "neovim" # Vim-fork focused on extensibility
brew "node" # JavaScript runtime
brew "overmind" # Process manager for Procfile-based apps
brew "pango" # Text layout and rendering library
brew "pkg-config" # Helper tool for compiling applications
brew "planetscale/tap/pscale" # PlanetScale database CLI
brew "postgresql" # Object-relational database system
brew "pygments" # Syntax highlighting library
brew "rcm" # Dotfile management tool
brew "re2" # Regular expression library
brew "redis", restart_service: true # In-memory data structure store
brew "ripgrep" # Fast recursive grep alternative
brew "trash" # removed: https://github.com/Homebrew/homebrew-core/pull/65438
brew "rtmpdump" # RTMP streaming media toolkit
brew "selenium-server" # Browser automation server
brew "sequel-ace" # MySQL/MariaDB database management
brew "shadowenv" # Directory-based environment variable manager
brew "shared-mime-info" # MIME type database
brew "shellcheck" # Shell script static analysis tool
brew "slack" # Team communication platform
brew "spotify" # Music streaming service
brew "sqlite" # Embedded SQL database engine
brew "srt" # Secure Reliable Transport library
brew "starship" # Cross-shell prompt
brew "stripe/stripe-cli/stripe" # Stripe command line tool
brew "tcl-tk" # Tcl/Tk scripting language
brew "the_silver_searcher" # Code searching tool (ag)
brew "thefuck" # Command correction tool
brew "tig" # Text-mode interface for Git
brew "tldr" # Simplified man pages
brew "tree" # Directory structure visualization
brew "watchman" # File watching service
brew "wget" # Internet file retriever
brew "yamllint" # YAML linter
brew "yarn" # JavaScript package manager
brew "youtube-dl" # Video download tool
brew "z" # Jump to frequently used directories
brew "zlib" # Compression library
cask "alfred" # Application launcher and productivity tool
cask "arq" # Backup software
cask "ccmenu" # Continuous integration monitoring
cask "chromedriver" # Chrome browser automation driver
cask "google-chrome" # Web browser
# cask "coconutbattery"
# cask "dash"
cask "dbeaver-community" # Universal database tool
cask "discord" # Voice and text chat platform
cask "docker" # Container platform
cask "firefox" # Web browser
# cask "fork" # Git client https://git-fork.com/
cask "freedom" # Website and app blocker
cask "github" # GitHub Desktop client
cask "gitify" # GitHub notifications in menu bar
cask "google-cloud-sdk" # Google Cloud Platform CLI
cask "google-drive" # Google Drive file sync
# cask "handbrake"
cask "hot" # Window manager for macOS
cask "istat-menus" # System monitoring in menu bar
cask "iterm2" # Terminal emulator
cask "karabiner-elements" # requires extra permissions
cask "keyboard-cleaner" # Lock keyboard for cleaning
cask "keycastr" # Keystroke visualizer
cask "kindle" # E-book reader
cask "kindlegen" # E-book conversion tool
cask "launchcontrol" # LaunchAgent and LaunchDaemon manager
cask "logitech-options" # requires sudo
cask "lunar" # External display brightness control
cask "marked" # Markdown preview tool
cask "meetingbar" # Menu bar calendar and meeting tool
# cask "mysqlworkbench"
# cask "mongodb"
# brew cask install menumeters # semi-abandoned?
cask "ngrok" # beware, different from https://dashboard.ngrok.com/get-started/setup ? e.g. no `ngrok config` https://dashboard.ngrok.com/get-started/setup
cask "notion" # Note-taking and collaboration tool
cask "nvidia-geforce-now" # Cloud gaming service
cask "obs" # Open Broadcaster Software for streaming
cask "omnidisksweeper" # Disk space analyzer
cask "omnifocus" # add license after install
# cask "onyx"
cask "phantomjs" # Headless WebKit browser
cask "plex" # Media server
cask "postman" # API development and testing tool
cask "qlcolorcode" # QuickLook plugin for code syntax highlighting
cask "qlimagesize" # QuickLook plugin for image dimensions
# cask "qlmarkdown" # Security warnings
cask "qlstephen" # QuickLook plugin for plain text files
cask "qlvideo" # QuickLook plugin for video files
cask "quicklook-csv" # QuickLook plugin for CSV files
cask "quicklook-json" # QuickLook plugin for JSON files
cask "quitter" # Automatically quit or hide apps
cask "rectangle" # need permissions on first launch
# cask "rubymine"
cask "rescuetime" # Time tracking and productivity tool
# cask "selfcontrol"
cask "send-to-kindle" # Send documents to Kindle
cask "sonos" # Sonos speaker controller
cask "sourcetree" # Git GUI client
# cask "stretchly"
cask "stremio" # Media streaming application
cask "the-unarchiver" # Archive extraction utility
# cask "time-out"
cask "transmission" # p2p
cask "tunnelbear" # VPN service
cask "tuple" # Pair programming tool
# cask "vagrant"
cask "vanilla" # Menu bar organizer
# cask "virtualbox" needs security allowance
# cask "visual-studio-code"
cask "vlc" # Media player
cask "webpquicklook" # QuickLook plugin for WebP images
# cask "whatsapp"
cask "zoom" # Video conferencing

# brew cask install qlcolorcode qlstephen qlmarkdown quicklook-json quicklook-csv qlimagesize webpquicklook qlvideo
