tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "planetscale/tap"
tap "shopify/shopify"
tap "stripe/stripe-cli"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "weaveworks/tap" # kubernetes
brew "act"
# brew "asciinema"
brew "automake" # for Shopify
brew "awscli"
brew "bat" # A cat(1) clone with wings.
brew "bison"
brew "cairo"
brew "cmake"
brew "composer"
brew "dark-mode"
brew "dep"
brew "docutils"
brew "exercism"
brew "ffmpeg"
brew "fish"
brew "foreman"
brew "fzf"
brew "fzy"
brew "gdbm"
brew "gh"
brew "git"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "guile"
brew "handbrake", link: false
brew "harfbuzz"
brew "heroku/brew/heroku"
# brew "hot" # 'formula is unreadable' error
brew "htop" # may need sudo
brew "hub"
brew "hugo"
brew "imagemagick@6"
brew "jq"
brew "jsonpp"
brew "kcat" # for Shopify
# brew "kibana" # elasticsearch dashboard # changed to an incompatible license
brew "leiningen" # for clojure
brew "libass"
brew "libgda"
brew "librdkafka" # for Shopify
brew "librsvg"
brew "libssh"
brew "libxml2"
brew "libyaml"
brew "markdownlint-cli"
brew "mas"
brew "memcached"
brew "mitmproxy"
# brew "mysql", restart_service: true, link: false
# brew "mysql-client@5.7", link: true
brew "ncdu" # disk usage
brew "neovim"
brew "node"
brew "overmind"
brew "pango"
brew "pkg-config"
brew "planetscale/tap/pscale"
brew "postgresql", restart_service: true
brew "pyenv" # for Shopify
brew "python@3.8"
brew "rcm"
brew "re2"
brew "redis", restart_service: true
brew "ripgrep"
brew "trash" # removed: https://github.com/Homebrew/homebrew-core/pull/65438
brew "rtmpdump"
brew "ruby"
brew "ruby-install"
brew "selenium-server"
brew "shadowenv"
brew "shared-mime-info"
brew "shellcheck"
brew "shopify/shopify/ejson"
brew "shopify/shopify/ejson2env"
brew "shopify/shopify/libzookeeper"
brew "shopify/shopify/secret-sender"
brew "shopify/shopify/shopify-cli", link: false
brew "shopify/shopify/shopify-graphicsmagick"
brew "shopify/shopify/shopify-imagemagick@6", link: true
brew "shopify/shopify/themekit"
brew "shopify/shopify/toxiproxy"
brew "sloccount"
brew "snappy" # for Shopify
# brew "spotify" # 'formula is unreadable'
brew "sqlite"
brew "srt"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tree"
brew "unbound"
# brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"] # no version for Apple Silicon yet
brew "v8@3.15"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zlib"
cask "alfred"
# cask "arq"
cask "brave-browser"
# cask "catch" # tv show rss feeds
cask "ccmenu"
cask "chromedriver"
# cask google-chrome # problems with 1password
# cask "coconutbattery"
# cask "cyberduck" # FTP client
# cask "dash"
cask "dbeaver-community"
cask "discord"
cask "docker"
# cask "dropbox"
cask "duet" # use iPad as external screen
cask "firefox"
# cask "fork" # Git client https://git-fork.com/
# cask "freedom"
cask "github"
cask "gitify"
cask "google-cloud-sdk"
# cask "google-drive"
# cask "handbrake"
cask "hot"
cask "istat-menus"
cask "iterm2"
cask "jdownloader"
# cask "karabiner-elements" # requires extra permissions
cask "keyboard-cleaner"
cask "keycastr"
# cask "kindle"
# cask "kindlegen"
cask "launchcontrol"
cask "logitech-options" # requires sudo
cask "lunar"
cask "marked"
cask "meetingbar"
# cask "mysqlworkbench"
# cask "mongodb"
# brew cask install menumeters # semi-abandoned?
cask "ngrok"
cask "notion"
# cask "nvidia-geforce-now"
cask "obs"
cask "omnidisksweeper"
# cask "omnifocus" # add license after install
cask "onyx"
cask "phantomjs"
cask "plex"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quitter"
cask "rectangle" # need permissions on first launch
cask "rescuetime"
# cask "selfcontrol"
cask "send-to-kindle"
cask "sonos"
# cask "soundflower" # no M1 yet. and may need security allowance
cask "sourcetree"
cask "spectacle"
cask "stretchly"
# cask "stremio"
cask "the-unarchiver"
# cask "time-out"
# cask "transmission" # p2p
# cask "tunnelbear"
cask "tuple"
cask "vagrant"
# cask "virtualbox" needs security allowance
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
# cask "whatsapp"
mas "AdBlock", id: 1402042596
# mas "Asphalt 9", id: 1491129197
# mas "City Island 3", id: 1281513602
mas "Flycut", id: 442160987
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lynda.com", id: 985958984
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "Trello", id: 1278508951
mas "Ulysses", id: 1225570693
mas "Up Next", id: 1355117041
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
